% 26.02.2025
% Я потерял исходные наработки из-за неудачной игры с гит...
% Я сначала не стал востанавливать это а сразу шел на state feedback в 3д
% квадрокоптере с грузом (тест 10), НО возникла проблема, что какого-то
% фига система "неуправляемая",  ранг R 14 против 16 остояниям
%|
%V
% Поэтому я решил попробовать сначала про систему без груза а потом
% вернуться к системе с грузом

%%
% Analyza stability vychoziho systemu
% Matice Ac a Bc z quad_equation_linearization_remake.mlx, 
% POKUD SE ZMENI, NUTNE RUCNE ZMENIT TADY:

syms M m g Ixx Iyy Izz k
Ac = [
0, 0, 0,  0, 0, 0,    1,    0,    0, 0, 0, 0;
0, 0, 0,  0, 0, 0,    0,    1,    0, 0, 0, 0;
0, 0, 0,  0, 0, 0,    0,    0,    1, 0, 0, 0;
0, 0, 0,  0, 0, 0,    0,    0,    0, 1, 0, 0;
0, 0, 0,  0, 0, 0,    0,    0,    0, 0, 1, 0;
0, 0, 0,  0, 0, 0,    0,    0,    0, 0, 0, 1;
0, 0, 0,  0, g, 0, -k/M,    0,    0, 0, 0, 0;
0, 0, 0, -g, 0, 0,    0, -k/M,    0, 0, 0, 0;
0, 0, 0,  0, 0, 0,    0,    0, -k/M, 0, 0, 0;
0, 0, 0,  0, 0, 0,    0,    0,    0, 0, 0, 0;
0, 0, 0,  0, 0, 0,    0,    0,    0, 0, 0, 0;
0, 0, 0,  0, 0, 0,    0,    0,    0, 0, 0, 0];

Bc = [
  0,     0,     0,     0;
  0,     0,     0,     0;
  0,     0,     0,     0;
  0,     0,     0,     0;
  0,     0,     0,     0;
  0,     0,     0,     0;
  0,     0,     0,     0;
  0,     0,     0,     0;
1/M,     0,     0,     0;
  0, 1/Ixx,     0,     0;
  0,     0, 1/Iyy,     0;
  0,     0,     0, 1/Izz];

Ac = subs(Ac, [M Ixx Iyy Izz g k], [3.3 1.1 2.989 3.9 9.81 0]);
Bc = subs(Bc, [M Ixx Iyy Izz g k], [3.3 1.1 2.989 3.9 9.81 0]);

Ac = double(Ac);
Bc = double(Bc);
Cc = eye(6, 12);
%%
% Je system riditelny?
R = ctrb(Ac, Bc);
rank(R) % --> 12, jako stavu (3 poloha, 3 uhlu a jejich derivace)

% Je system pozorovatelny ?
P = obsv(Ac, Cc);
rank(P) % --> 12, take OK


